# Gregory's Brewfile
# Managed by dotfiles repository: https://github.com/gastevens/.dotfiles

# ==============================
# Taps (Third-party repositories)
# ==============================
tap "emmercm/igir"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lotyp/formulae"
tap "rcmdnk/file"

# ==============================
# Core Utilities & Development Tools
# ==============================
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "bat"              # Better cat
brew "coreutils"        # GNU core utilities
brew "bats-core"        # Bash Automated Testing System
brew "gnupg"            # GNU Privacy Guard
brew "ssh-copy-id"      # Install SSH keys on a remote server
brew "stow"             # Symlink farm manager
brew "tree"             # Directory listings as trees
brew "wget"             # Internet file retriever
brew "curl"             # Command line tool for transferring data
brew "git"              # Distributed version control system
brew "git-delta"        # Syntax-highlighting pager for git
brew "git-extras"       # Extra git commands
brew "git-lfs"          # Git extension for versioning large files
brew "grep"             # GNU grep
brew "gnu-sed"          # GNU implementation of sed
brew "fd"               # Simple, fast alternative to find
brew "ripgrep"          # Fast, recursive grep alternative
brew "fzf"              # Fuzzy file finder
brew "the_silver_searcher" # Code-searching tool (ag)
brew "jq"               # Lightweight JSON processor
brew "shellcheck"       # Shell script static analysis tool
brew "trash"            # Safe rm alternative
brew "tmux"             # Terminal multiplexer
brew "zoxide"           # Smarter cd command
brew "zsh"              # Modern shell

# ==============================
# Languages & Language Tools
# ==============================
brew "python@3.13"      # Latest Python
brew "python@3.10"      # Python 3.10
brew "python-tk@3.13"   # Tkinter for Python
brew "node"             # Node.js
brew "n"                # Node version manager
brew "ruby"             # Ruby programming language
brew "rust"             # Rust programming language
brew "pipx"             # Install and run Python applications in isolated environments

# ==============================
# Libraries & Dependencies
# ==============================
brew "cairo"            # Vector graphics library
brew "icu4c@76"         # Unicode and globalization support library
brew "libtool"          # Generic library support
brew "libusb"           # USB access library
brew "pkgconf"          # Package compiler and linker metadata toolkit
brew "sdl2"             # Low-level access to audio, keyboard, mouse, etc.
brew "sdl2_image"       # SDL2 image loading library
brew "sdl2_mixer"       # SDL2 audio mixer library

# ==============================
# Multimedia & File Utilities
# ==============================
brew "ffmpeg"           # Play, record, convert, and stream audio and video
brew "imagemagick"      # Image manipulation tools
brew "unar"             # Unarchiver
brew "xdelta"           # Binary diff, differential compression tools
brew "f3"               # Fight Flash Fraud
brew "rename"           # File rename utility
brew "rclone"           # Rsync for cloud storage
brew "transmission-cli" # Lightweight BitTorrent client (CLI)

# ==============================
# Productivity & Workflow Tools
# ==============================
brew "mas"              # Mac App Store command line interface
brew "nano"             # Simple text editor
brew "thefuck"          # Magnificent app which corrects your previous console command
brew "topgrade"         # Upgrades everything
brew "croc"             # File transfer tool
brew "duti"             # Select default apps for document types
brew "gh"               # GitHub CLI
brew "grip"             # GitHub Readme Instant Preview
brew "httpie"           # User-friendly HTTP client
brew "psgrep"           # Shorthand for 'ps aux | grep'
brew "uni"              # Unicode database query tool

# ==============================
# Specialized Tools
# ==============================
brew "carthage"         # Dependency manager for Cocoa applications
brew "cmake"            # Cross-platform make
brew "cmake-docs"       # Documentation for CMake
brew "rom-tools"        # ROM management tools
brew "syncthing", restart_service: :changed # Open source continuous file synchronization
brew "winetricks"       # Helper for WINE

# ==============================
# Third-party Brews
# ==============================
brew "emmercm/igir/igir"
brew "lotyp/formulae/dockutil"
brew "rcmdnk/file/brew-file"

# ==============================
# Applications (Casks)
# ==============================
cask "1password"              # Password manager
cask "1password-cli"          # Command-line helper for 1Password
cask "alt-tab"                # Windows-like alt-tab
cask "appcleaner"             # App uninstaller
cask "arc"                    # Browser
cask "barrier"                # Software KVM
cask "bbedit"                 # Text editor
cask "betterdiscord-installer" # Discord enhancer
cask "betterdisplay"          # Display management
cask "calibre"                # E-book management
cask "camo-studio"            # Use iPhone as webcam
cask "cardhop"                # Contact manager
cask "chatgpt"                # ChatGPT desktop
cask "cleanmymac"             # macOS cleaner
cask "coconutbattery"         # Battery health monitor
cask "discord"                # Voice and text chat
cask "fantastical"            # Calendar
cask "firefox"                # Web browser
cask "font-departure-mono"    # Monospace font
cask "font-fira-code"         # Monospace font
cask "font-hack"              # Monospace font
cask "fork"                   # Git client
cask "gitkraken"              # Git GUI
cask "gog-galaxy"             # Gaming client
cask "google-chrome"          # Web browser
cask "google-chrome@canary"   # Dev version of Chrome
cask "gstreamer-runtime"      # Multimedia framework
cask "heroic"                 # Epic Games launcher
cask "iina"                   # Media player
cask "iterm2"                 # Terminal emulator
cask "jordanbaird-ice"        # Menu bar customization
cask "keka"                   # File archiver
cask "logi-options+"          # Logitech device manager
cask "lulu"                   # Firewall
cask "maccy"                  # Clipboard manager
cask "mactex"                 # LaTeX distribution
cask "microsoft-auto-update"  # Microsoft updater
cask "microsoft-teams"        # Team collaboration
cask "mimestream"             # Gmail email client
cask "monitorcontrol"         # External display brightness control
cask "mono-mdk"               # Mono development kit
cask "notion"                 # Productivity tool
cask "notchnook"              # Notch utility
cask "notunes"                # Disable iTunes
cask "proton-drive"           # Secure cloud storage
cask "raycast"                # Launcher
cask "rectangle"              # Window manager
cask "retroarch"              # Emulator frontend
cask "sf-symbols"             # Apple symbols
cask "slack"                  # Team communication
cask "spotify"                # Music streaming
cask "steam"                  # Gaming platform
cask "steermouse"             # Mouse customization
cask "symboliclinker"         # Finder extension for symlinks
cask "the-unarchiver"         # File extraction utility
cask "transmission"           # BitTorrent client
cask "visual-studio-code"     # Code editor
cask "vlc"                    # Media player
cask "warp"                   # Terminal
cask "whisky"                 # Wine wrapper
cask "wine-stable"            # Windows compatibility layer
cask "yacreader"              # Comic reader
cask "zoom"                   # Video conferencing

# ==============================
# Visual Studio Code Extensions
# ==============================
vscode "bierner.markdown-preview-github-styles"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.powershell"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "tinkertrain.theme-panda"
vscode "yzhang.markdown-all-in-one"

# ==============================
# Mac App Store Applications
# ==============================
mas "1Blocker", id: 1365531024
mas "1Password for Safari", id: 1569813296
mas "Amphetamine", id: 937984704
mas "Balatro", id: 6502451661
mas "Calcbot", id: 931657367
mas "Capture", id: 6458535284
mas "CARROTweather", id: 993487541
mas "CleanMyMac", id: 1339170533
mas "Copilot", id: 1447330651
mas "Developer", id: 640199958
mas "Dropover", id: 1355679052
mas "DualSenseM", id: 1598693570
mas "Fakespot", id: 1592541616
mas "FieldKit", id: 1612653346
mas "FileZilla Pro", id: 1298486723
mas "Flighty", id: 1358823008
mas "Friendly Streaming", id: 553245401
mas "GameTrack", id: 1136800740
mas "GoodLinks", id: 1474335294
mas "Hand Mirror", id: 1502839586
mas "Hush", id: 1544743900
mas "iA Writer", id: 775737590
mas "Icon Preview", id: 6480373509
mas "Ivory", id: 6444602274
mas "Kagi for Safari", id: 1622835804
mas "Kindle", id: 302584613
mas "Lickable Menu Bar", id: 6444217677
mas "LookUp", id: 872564448
mas "Mela", id: 1568924476
mas "Microsoft Excel", id: 462058435
mas "MusicBox", id: 1614730313
mas "MusicHarbor", id: 1440405750
mas "MusicSmart", id: 1512195368
mas "mymind", id: 1532801185
mas "Omnivore", id: 1564031042
mas "Parcel", id: 639968404
mas "Pastebot", id: 1179623856
mas "Photomator", id: 1444636541
mas "Pixelmator Pro", id: 1289583905
mas "Play", id: 1596506190
mas "Prime Video", id: 545519333
mas "Prompt", id: 1594420480
mas "Reeder", id: 6475002485
mas "Reeder", id: 1529448980
mas "Refined GitHub", id: 1519867270
mas "Save to Raindrop.io", id: 1549370672
mas "Save to Reader", id: 1640236961
mas "Sink It", id: 6449873635
mas "Sofa", id: 1276554886
mas "Steam Link", id: 1246969117
mas "StopTheMadness Pro", id: 6471380298
mas "Things", id: 904280696
mas "Tot", id: 1491071483
mas "Tripsy", id: 1429967544
mas "Xcode", id: 497799835
