tap "emmercm/igir"
tap "homebrew/bundle"
tap "homebrew/services"
tap "lotyp/formulae"
tap "rcmdnk/file"
brew "autoconf"
brew "automake"
brew "openssl@3"
brew "bat"
brew "coreutils"
brew "bats-core"
brew "cairo"
brew "carthage"
brew "cmake"
brew "cmake-docs"
brew "croc"
brew "duti"
brew "f3"
brew "fd"
brew "icu4c@76"
brew "sdl2"
brew "python@3.13"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "git-delta"
brew "git-extras"
brew "git-lfs"
brew "gnu-sed"
brew "grep"
brew "grip"
brew "httpie"
brew "libtool"
brew "imagemagick"
brew "jq"
brew "libusb"
brew "mas"
brew "n"
brew "nano"
brew "node"
brew "pipx"
brew "pkgconf"
brew "psgrep"
brew "python-tk@3.13"
brew "rclone"
brew "rename"
brew "ripgrep"
brew "rom-tools"
brew "ruby"
brew "rust"
brew "sdl2_image"
brew "sdl2_mixer"
brew "shellcheck"
brew "ssh-copy-id"
brew "stow"
brew "syncthing", restart_service: :changed
brew "the_silver_searcher"
brew "thefuck"
brew "tmux"
brew "topgrade"
brew "transmission-cli"
brew "trash"
brew "tree"
brew "unar"
brew "uni"
brew "wget"
brew "winetricks"
brew "zoxide"
brew "zsh"
brew "emmercm/igir/igir"
brew "lotyp/formulae/dockutil"
brew "rcmdnk/file/brew-file"
cask "1password"
cask "1password-cli"
cask "alt-tab"
cask "appcleaner"
cask "arc"
cask "barrier"
cask "bbedit"
cask "betterdiscord-installer"
cask "betterdisplay"
cask "calibre"
cask "camo-studio"
cask "cardhop"
cask "chatgpt"
cask "cleanmymac"
cask "coconutbattery"
cask "discord"
cask "fantastical"
cask "firefox"
cask "font-departure-mono"
cask "font-fira-code"
cask "font-hack"
cask "fork"
cask "gitkraken"
cask "gog-galaxy"
cask "google-chrome"
cask "google-chrome@canary"
cask "gstreamer-runtime"
cask "heroic"
cask "iina"
cask "iterm2"
cask "jordanbaird-ice"
cask "keka"
cask "logi-options+"
cask "lulu"
cask "maccy"
cask "mactex"
cask "microsoft-auto-update"
cask "microsoft-teams"
cask "mimestream"
cask "monitorcontrol"
cask "mono-mdk"
cask "notchnook"
cask "notunes"
cask "proton-drive"
cask "raycast"
cask "rectangle"
cask "retroarch"
cask "sf-symbols"
cask "slack"
cask "spotify"
cask "steam"
cask "steermouse"
cask "symboliclinker"
cask "the-unarchiver"
cask "transmission"
cask "visual-studio-code"
cask "vlc"
cask "warp"
cask "whisky"
cask "wine-stable"
cask "yacreader"
vscode "bierner.markdown-preview-github-styles"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ms-python.python"
vscode "ms-vscode.powershell"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "tinkertrain.theme-panda"
vscode "yzhang.markdown-all-in-one"
